---
kind: other
id: Properties.T:Autodesk.Revit.DB.ExternalFileReference
source: html/753422c5-bbd6-3af2-b5b0-b7a2fa43ff9c.htm
---
# ExternalFileReference Properties

The type of external file which this object
 references.